
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.DB-URL[0]
* Replace
  * azurerm_key_vault_secret.FLEXIBLE-DB-URL[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.DB-URL[0] will be destroyed
  # (because azurerm_key_vault_secret.DB-URL is not in configuration)
  - resource "azurerm_key_vault_secret" "DB-URL" {
      - id                      = "https://dtsse-aat.vault.azure.net/secrets/db-url/3224cb717fa44cfa8f10a85f57289275" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat" -> null
      - name                    = "db-url" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat/secrets/db-url/versions/3224cb717fa44cfa8f10a85f57289275" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat/secrets/db-url" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "3224cb717fa44cfa8f10a85f57289275" -> null
      - versionless_id          = "https://dtsse-aat.vault.azure.net/secrets/db-url" -> null
    }

  # azurerm_key_vault_secret.FLEXIBLE-DB-URL[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "FLEXIBLE-DB-URL" {
      ~ id                      = "https://dtsse-aat.vault.azure.net/secrets/flexible-db-url/5a307591f8f04bffbbc88703a469ef70" -> (known after apply)
      ~ name                    = "flexible-db-url" -> "db-url" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat/secrets/flexible-db-url/versions/5a307591f8f04bffbbc88703a469ef70" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat/secrets/flexible-db-url" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "5a307591f8f04bffbbc88703a469ef70" -> (known after apply)
      ~ versionless_id          = "https://dtsse-aat.vault.azure.net/secrets/flexible-db-url" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat|dtsse-aat"
        name                       = "dtsse-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":56,"Program":"tfcmt","SHA1":"","Vars":{}} -->